fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>ЗарплатаКВыплате</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ВКМ_Валюта</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_Выплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере(Объект.Дата);
	
	Элементы.ЗарплатаКВыплате.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(Дата)
	
	 Объект.ЗарплатаКВыплате.Очистить();
	
	ПолучитьДвижения(Дата);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДвижения(Дата)  

	Запрос = Новый Запрос;    
		
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК Сумма,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток <> 0
	|			ТОГДА ""Заработная плата на конец прошлого месяца""
	|	КОНЕЦ КАК Комментарий
	|	//	|ПОМЕСТИТЬ ВТ_ВходящееСальдо
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&КонецПрошлогоМесяца) КАК
	|		ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|ГДЕ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток <> &Ноль
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
	|	ВЫБОР
	|		КОГДА ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток <> 0
	|			ТОГДА ""Заработная плата на конец прошлого месяца""
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";	
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВЫБОР
//	|		КОГДА ВКМ_ВзаиморасчетыССотрудниками.Сумма <> 0
//	|			ТОГДА ""Начислено в текущем месяце""
//	|	КОНЕЦ КАК Комментарий,
//	|	ВКМ_ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
//	|	СУММА(ВКМ_ВзаиморасчетыССотрудниками.Сумма) КАК СуммаНачисления,
//	|	СУММА(ВКМ_ВзаиморасчетыССотрудниками1.Сумма) КАК СуммаУдержания
//	|ПОМЕСТИТЬ ВТ_Начисления
//	|ИЗ
//	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками КАК ВКМ_ВзаиморасчетыССотрудниками
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками КАК ВКМ_ВзаиморасчетыССотрудниками1
//	|		ПО ВКМ_ВзаиморасчетыССотрудниками1.Сотрудник = ВКМ_ВзаиморасчетыССотрудниками.Сотрудник
//	|ГДЕ
//	|	ВКМ_ВзаиморасчетыССотрудниками.Период МЕЖДУ &НачалоТекущегоМесяца И &КонецТекущегоМесяца
//	|	И ВКМ_ВзаиморасчетыССотрудниками.ВидДвижения = &Приход
//	|	И ВКМ_ВзаиморасчетыССотрудниками1.Период МЕЖДУ &НачалоТекущегоМесяца И &КонецТекущегоМесяца
//	|	И ВКМ_ВзаиморасчетыССотрудниками1.ВидДвижения = &Расход
//	|СГРУППИРОВАТЬ ПО
//	|	ВКМ_ВзаиморасчетыССотрудниками.Сотрудник,
//	|	ВЫБОР
//	|		КОГДА ВКМ_ВзаиморасчетыССотрудниками.Сумма <> 0
//	|			ТОГДА ""Начислено в текущем месяце""
//	|	КОНЕЦ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЕСТЬNULL(ВТ_Начисления.Сотрудник, 0) КАК Сотрудник,
//	|	ЕСТЬNULL(ВТ_Начисления.СуммаНачисления - ВТ_Начисления.СуммаУдержания, 0) КАК Сумма,
//	|	ВТ_Начисления.Комментарий КАК Комментарий
//	|ИЗ
//	|	ВТ_Начисления КАК ВТ_Начисления
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЕСТЬNULL(ВТ_ВходящееСальдо.Сотрудник, 0),
//	|	ЕСТЬNULL(ВТ_ВходящееСальдо.Сумма, 0),
//	|	ВТ_ВходящееСальдо.Комментарий
//	|ИЗ
//	|	ВТ_ВходящееСальдо КАК ВТ_ВходящееСальдо
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Сотрудник";	
	
	Запрос.УстановитьПараметр("КонецПрошлогоМесяца", КонецМесяца(ДобавитьМесяц(Дата,-1)));
	Запрос.УстановитьПараметр("КонецТекущегоМесяца", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоТекущегоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ноль", 0);
	Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);	
	Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);		
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() <> 0 Тогда
	
	ТЗдляЗаполнения = Новый ТаблицаЗначений;
	ТЗдляЗаполнения.Колонки.Добавить("Сотрудник");
	ТЗдляЗаполнения.Колонки.Добавить("ВидРасчета");	
	ТЗДляЗаполнения.Колонки.Добавить("Сумма");
	ТЗДляЗаполнения.Колонки.Добавить("Комментарий");
	
		
	Для каждого Строка из ТЗ Цикл
			
	Если Строка.Сумма <> 0 Тогда
		
		СтрокаДляЗаполнения = ТЗдляЗаполнения.Добавить();
		СтрокаДляЗаполнения.Сотрудник = Строка.Сотрудник;
		СтрокаДляЗаполнения.ВидРасчета = ПланыВидовРасчета.ВКМ_Выплаты.Выплата;
		СтрокаДляЗаполнения.Сумма = Строка.Сумма;
		СтрокаДляЗаполнения.Комментарий = Строка.Комментарий + СтрШаблон(" по состоянию на %1.", Формат(Дата,"ДЛФ=DD"));
	
	КонецЕсли;     
	
	КонецЦикла;
	
		Объект.ЗарплатаКВыплате.Загрузить(ТЗдляЗаполнения);
	
	Иначе 
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "За текущий период неоплаченные начисления отсутствуют";
		Сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры
